# Shell / prompt
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"

# CLI essentials
brew "fzf"
brew "zoxide"
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "tldr"
brew "gh"

# Version manager
brew "fnm"

# Apps
cask "ghostty"
cask "visual-studio-code"
cask "orbstack"
cask "google-chrome"
cask "raycast"
cask "slack"
